In [4]:
#import library
import pandas as pd
import numpy as np

In [5]:
#read data
data=pd.read_csv("assignmentsql.csv")
subject=pd.read_csv("assignmentsql2.csv")

In [6]:
data

   data_id  Subject_id  value1  value2
0        1         101      10       5
1        2         102      20       8
2        3         103      15      12
3        4         104      25       3
4        5         105      30       6

In [7]:
subject

   Subject_id Subject_name
0         101  Mathematics
1         102      Physics
2         103    Chemistry
3         104      Biology
4         105      History

In [8]:
#transform data
data['value2'] = data['value2'] ** 2

In [9]:
data

   data_id  Subject_id  value1  value2
0        1         101      10      25
1        2         102      20      64
2        3         103      15     144
3        4         104      25       9
4        5         105      30      36

In [10]:
#merge Table
result = pd.merge(data, subject, on='Subject_id', how='inner')
result

   data_id  Subject_id  value1  value2 Subject_name
0        1         101      10      25  Mathematics
1        2         102      20      64      Physics
2        3         103      15     144    Chemistry
3        4         104      25       9      Biology
4        5         105      30      36      History

In [11]:
result.to_csv('result.csv', index=False) #make csv

In [13]:
#connect sql
import mysql.connector

db_connection = mysql.connector.connect(
    host='localhost',
    user='root',
    password='12345',
    database='assignment'
)

cursor = db_connection.cursor()

In [ ]:
create_table_query = """
CREATE TABLE IF NOT EXISTS your_table_name (
    data_id INT,
    Subject_id INT,
    value1 INT,
    value2 INT,
    Subject_name VARCHAR(255)
)
"""

In [14]:
cursor.execute('CREATE TABLE IF NOT EXISTS result (data_id INT,Subject_id INT,value1 INT,value2 INT,Subject_name VARCHAR(255))')
db_connection.commit()

In [15]:
data = [
    (1, 101, 10, 25, 'Mathematics'),
    (2, 102, 20, 64, 'Physics'),
    (3, 103, 15, 144, 'Chemistry'),
    (4, 104, 25, 9, 'Biology'),
    (5, 105, 30, 36, 'History')
]

insert_query = "INSERT INTO result (data_id, Subject_id, value1, value2, Subject_name) VALUES (%s, %s, %s, %s, %s)"
cursor.executemany(insert_query, data)
db_connection.commit()